In [1]:
import pandas as pd

In [6]:
dataset=pd.read_csv(r'E:\clg.csv')

In [8]:
# dataset[dataset.id>1]

In [10]:
dataset[(dataset.id>2) & (dataset.age>23)]

   id   name  age class  session
3   3  shela   24  bscs  2016-20

In [11]:
dataset

   id     name  age class  session
0   0    hamza   22  bscs  2016-20
1   1  shabbir   24  bscs  2016-20
2   2   farhan   22  bscs  2016-20
3   3    shela   24  bscs  2016-20
4   4    arbaz   23  bscs  2016-20